var zjiptv={

"CCTV1":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226231/index.m3u8",

"CCTV2":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226195/index.m3u8",

"CCTV3":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226397/index.m3u8",

"CCTV4":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226191/index.m3u8",

"CCTV5":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226395/index.m3u8",

"CCTV5+":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226221/index.m3u8",

"CCTV6":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226393/index.m3u8",

"CCTV7":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226192/index.m3u8",

"CCTV8":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226391/index.m3u8",

"CCTV9":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226197/index.m3u8",

"CCTV10":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226189/index.m3u8",

"CCTV11":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226240/index.m3u8",

"CCTV12":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226190/index.m3u8",

"CCTV13":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226233/index.m3u8",

"CCTV14":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226193/index.m3u8",

"CCTV15":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221225785/index.m3u8",

"CCTV16":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226921/index.m3u8",

"CCTV17":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226198/index.m3u8"};

var qtiptv={
  "北京卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226222/index.m3u8",

"天津卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226204/index.m3u8",

"东方卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226217/index.m3u8",

"重庆卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226202/index.m3u8",

"湖南卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226211/index.m3u8",

"浙江卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226199/index.m3u8",

"江苏卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226200/index.m3u8",

"山东卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226209/index.m3u8",

"广东卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226216/index.m3u8",

"深圳卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226205/index.m3u8",

"安徽卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226196/index.m3u8",

"四川卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221225768/index.m3u8",

"陕西卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221225821/index.m3u8",

"山西卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221225763/index.m3u8",

"湖北卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226194/index.m3u8",

"河北卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221225750/index.m3u8",

"东南卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221225766/index.m3u8",

"河南卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221225767/index.m3u8",

"江西卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221225764/index.m3u8",

"广西卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221225770/index.m3u8",

"内蒙古卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221225786/index.m3u8",

"海南卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221225769/index.m3u8",

"云南卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221225751/index.m3u8",

"贵州卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221225793/index.m3u8",

"宁夏卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221225748/index.m3u8",

"甘肃卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221225754/index.m3u8",

"黑龙江卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221225802/index.m3u8",

"吉林卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221225792/index.m3u8",

"辽宁卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221226210/index.m3u8",

"新疆卫视":"http://dbiptv.sn.chinamobile.com/PLTV/88888890/224/3221225747/index.m3u8"};

var ipiptv={
"黑莓电竞":"http://39.134.115.163:8080/PLTV/88888910/224/3221225653/index.m3u8",

"黑莓电影":"http://39.134.115.163:8080/PLTV/88888910/224/3221225718/index.m3u8",

"潮妈辣婆":"http://111.40.196.38/PLTV/88888888/224/3221225680/index.m3u8",

"潮妈辣婆":"http://39.134.66.66/PLTV/88888888/224/3221225538/index.m3u8",

"潮妈辣婆":"http://39.135.138.58:18890/PLTV/88888888/224/3221225712/index.m3u8",

"潮妈辣婆":"http://39.134.65.166/PLTV/88888888/224/3221225521/1.",

"爱情喜剧":"http://111.40.196.38/PLTV/88888888/224/3221225616/index.m3u8",

"爱情喜剧":"http://39.134.66.66/PLTV/88888888/224/3221225547/index.m3u8",

"爱情喜剧":"http://39.135.138.58:18890/PLTV/88888888/224/3221225656/index.m3u8",

"古装剧场":"http://111.40.196.36/PLTV/88888888/224/3221225618/index.m3u8",

"古装剧场":"http://39.134.115.163:8080/PLTV/88888910/224/3221225678/index.m3u8",

"古装剧场":"http://39.134.65.166/PLTV/88888888/224/3221225524/1.",

"古装剧场":"http://39.134.65.164/PLTV/88888888/224/3221225524/1.",

"古装剧场":"http://39.135.138.60:18890/PLTV/88888910/224/3221225678/index.m3u8",

"动作电影":"http://111.40.196.31/PLTV/88888888/224/3221225620/index.m3u8",

"动作电影":"http://39.134.66.66/PLTV/88888888/224/3221225642/index.m3u8",

"动作电影":"http://39.135.138.58:18890/PLTV/88888888/224/3221225620/index.m3u8",

"动作电影":"http://39.134.65.164/PLTV/88888888/224/3221225642/1.",

"动作电影":"http://39.135.138.60:18890/PLTV/88888910/224/3221225620/index.m3u8",

"动作电影":"http://39.134.66.66/PLTV/88888888/224/3221225524/index.m3u8",

"动作电影":"http://39.135.138.58:18890/PLTV/88888888/224/3221225678/index.m3u8",

"军旅剧场":"http://111.40.196.28/PLTV/88888888/224/3221225622/index.m3u8",

"军旅剧场":"http://39.134.115.163:8080/PLTV/88888910/224/3221225669/index.m3u8",

"军旅剧场":"http://39.134.65.164/PLTV/88888888/224/3221225644/1.",

"军旅剧场":"http://39.134.65.179/PLTV/88888888/224/3221225644/1.",

"军旅剧场":"http://39.134.65.173/PLTV/88888888/224/3221225644/1.",

"军旅剧场":"http://39.134.65.175/PLTV/88888888/224/3221225644/1.",

"军旅剧场":"http://39.134.65.164/PLTV/88888888/224/3221225560/1.",

"军旅剧场":"http://39.135.138.60:18890/PLTV/88888910/224/3221225669/index.m3u8",

"精品纪录":"http://111.40.196.28/PLTV/88888888/224/3221225630/index.m3u8",

"精品纪录":"http://39.134.115.163:8080/PLTV/88888910/224/3221225710/index.m3u8",

"精品纪录":"http://39.134.66.66/PLTV/88888888/224/3221225646/index.m3u8",

"精品纪录":"http://39.134.65.164/PLTV/88888888/224/3221225646/1.",

"精品纪录":"http://39.135.138.60:18890/PLTV/88888910/224/3221225707/index.m3u8",

"精品体育":"http://111.40.196.37/PLTV/88888888/224/3221225608/index.m3u8",

"精品体育":"http://39.134.65.166/PLTV/88888888/224/3221225547/1.",

"军事评论":"http://111.40.196.39/PLTV/88888888/224/3221225634/index.m3u8",

"军事评论":"http://39.134.66.66/PLTV/88888888/224/3221225644/index.m3u8",

"军事评论":"http://39.135.138.58:18890/PLTV/88888888/224/3221225623/index.m3u8",

"军事评论":"http://39.134.66.66/PLTV/88888888/224/3221225535/index.m3u8",

"军事评论":"http://39.135.138.58:18890/PLTV/88888888/224/3221225757/index.m3u8",

"军事评论":"http://39.134.65.166/PLTV/88888888/224/3221225535/1.",

"军事评论":"http://39.134.65.164/PLTV/88888888/224/3221225535/1.",

"军事评论":"http://39.135.138.60:18890/PLTV/88888910/224/3221225757/index.m3u8",

"惊悚悬疑":"http://111.40.196.32/PLTV/88888888/224/3221225638/index.m3u8",

"惊悚悬疑":"http://39.134.65.166/PLTV/88888888/224/3221225525/1.",

"惊悚悬疑":"http://39.134.65.173/PLTV/88888888/224/3221225525/1.",

"惊悚悬疑":"http://39.134.65.175/PLTV/88888888/224/3221225525/1.",

"惊悚悬疑":"http://39.134.65.166/PLTV/88888888/224/3221225555/1.",

"惊悚悬疑":"http://39.134.65.164/PLTV/88888888/224/3221225555/1.",

"家庭剧场":"http://111.40.196.39/PLTV/88888888/224/3221225626/index.m3u8",

"家庭剧场":"http://39.134.66.66/PLTV/88888888/224/3221225552/index.m3u8",

"家庭剧场":"http://39.135.138.58:18890/PLTV/88888888/224/3221225670/index.m3u8",

"家庭剧场":"http://39.134.66.66/PLTV/88888888/224/3221225550/index.m3u8",

"农业致富":"http://111.40.196.35/PLTV/88888888/224/3221225636/index.m3u8",

"农业致富":"http://39.134.115.163:8080/PLTV/88888910/224/3221225670/index.m3u8",

"农业致富":"http://39.134.66.66/PLTV/88888888/224/3221225604/index.m3u8",

"农业致富":"http://39.134.65.164/PLTV/88888888/224/3221225604/1.",

"农业致富":"http://39.135.138.60:18890/PLTV/88888910/224/3221225660/index.m3u8",

"武搏世界":"http://111.40.196.39/PLTV/88888888/224/3221225664/index.m3u8",

"武搏世界":"http://39.134.65.166/PLTV/88888888/224/3221225552/1.",

"武搏世界":"http://39.134.65.164/PLTV/88888888/224/3221225552/1.",

"武搏世界":"http://39.135.138.60:18890/PLTV/88888910/224/3221225670/index.m3u8",

"武搏世界":"http://39.134.65.166/PLTV/88888888/224/3221225553/1.",

"武搏世界":"http://39.134.65.164/PLTV/88888888/224/3221225553/1.",

"中国功夫":"http://111.40.196.38/PLTV/88888888/224/3221225678/index.m3u8",

"中国功夫":"http://39.134.65.164/PLTV/88888888/224/3221225679/1.",

"中国功夫":"http://39.134.65.173/PLTV/88888888/224/3221225679/1.",

"中国功夫":"http://39.134.66.66/PLTV/88888888/224/3221225571/index.m3u8",

"中国功夫":"http://39.134.65.164/PLTV/88888888/224/3221225571/1.",

"超级电视剧":"http://39.134.66.66/PLTV/88888888/224/3221225545/index.m3u8",

"超级电视剧":"http://39.135.138.58:18890/PLTV/88888888/224/3221225710/index.m3u8",

"超级电视剧":"http://39.134.65.166/PLTV/88888888/224/3221225545/1.",

"超级电视剧":"http://39.135.138.60:18890/PLTV/88888910/224/3221225710/index.m3u8",

"超级电视剧":"http://39.134.67.2:80/ottrrs.hl.chinamobile.com/PLTV/88888888/224/3221225672/1.",

"超级电视剧":"http://39.134.67.6:80/ottrrs.hl.chinamobile.com/PLTV/88888888/224/3221225672/1.",

"超级电视剧":"http://39.134.67.7:80/ottrrs.hl.chinamobile.com/PLTV/88888888/224/3221225672/1.",

"超级体育":"http://39.134.66.66/PLTV/88888888/224/3221225526/index.m3u8",

"超级体育":"http://39.134.65.166/PLTV/88888888/224/3221225526/1.",

"超级体育":"http://39.135.138.60:18890/PLTV/88888910/224/3221225709/index.m3u8",

"金牌综艺":"http://39.135.138.58:18890/PLTV/88888888/224/3221225622/index.m3u8",

"金牌综艺":"http://39.135.138.58:18890/PLTV/88888888/224/3221225648/index.m3u8",

"金牌综艺":"http://39.134.65.164/PLTV/88888888/224/3221225635/1.",

"精品大剧":"http://39.134.115.163:8080/PLTV/88888910/224/3221225714/index.m3u8",

"精品大剧":"http://39.134.66.66/PLTV/88888888/224/3221225542/index.m3u8",

"精品大剧":"http://39.135.138.58:18890/PLTV/88888888/224/3221225708/index.m3u8",

"精品大剧":"http://39.134.65.166/PLTV/88888888/224/3221225542/1.",

"精品大剧":"http://39.134.65.164/PLTV/88888888/224/3221225542/1.",

"精品大剧":"http://39.135.138.60:18890/PLTV/88888910/224/3221225708/index.m3u8",

"炫舞未来":"http://39.134.115.163:8080/PLTV/88888910/224/3221225707/index.m3u8",

"炫舞未来":"http://39.134.65.164/PLTV/88888888/224/3221225538/1.",

"炫舞未来":"http://39.135.138.60:18890/PLTV/88888910/224/3221225713/index.m3u8",

"精品综合":"http://39.134.66.66/PLTV/88888888/224/3221225533/index.m3u8",

"精品综合":"http://39.134.65.166/PLTV/88888888/224/3221225533/1.",

"精品综合":"http://39.134.65.164/PLTV/88888888/224/3221225533/1.",

"超级电影":"http://39.134.66.66/PLTV/88888888/224/3221225536/index.m3u8",

"超级电影":"http://39.135.138.58:18890/PLTV/88888888/224/3221225714/index.m3u8",

"超级电影":"http://39.134.65.166/PLTV/88888888/224/3221225536/1.",

"超级电影":"http://39.135.138.60:18890/PLTV/88888910/224/3221225714/index.m3u8",

"超级综艺":"http://39.135.138.58:18890/PLTV/88888888/224/3221225716/index.m3u8",

"超级综艺":"http://39.134.65.166/PLTV/88888888/224/3221225550/1.",

"超级综艺":"http://39.134.65.164/PLTV/88888888/224/3221225550/1.",

"明星大片":"http://39.134.66.66/PLTV/88888888/224/3221225637/index.m3u8",

"明星大片":"http://39.135.138.58:18890/PLTV/88888888/224/3221225625/index.m3u8",

"明星大片":"http://39.134.65.164/PLTV/88888888/224/3221225637/1.",

"明星大片":"http://39.135.138.58:18890/PLTV/88888888/224/3221226210/index.m3u8",

"明星大片":"http://39.134.65.179/PLTV/88888888/224/3221225682/1.",

"明星大片":"http://39.134.65.166/PLTV/88888888/224/3221225682/1.",

"明星大片":"http://39.134.65.173/PLTV/88888888/224/3221225682/1.",

"明星大片":"http://39.134.65.175/PLTV/88888888/224/3221225682/1.",

"动画王国":"http://39.134.65.179/PLTV/88888888/224/3221225637/1.",

"动画王国":"http://39.134.65.181/PLTV/88888888/224/3221225637/1.",

"动画王国":"http://39.134.65.173/PLTV/88888888/224/3221225637/1.",

"动画王国":"http://39.134.65.183/PLTV/88888888/224/3221225637/1.",

"欢乐剧场":"http://39.134.66.66/PLTV/88888888/224/3221225525/index.m3u8",

"欢乐剧场":"http://39.135.138.58:18890/PLTV/88888888/224/3221225711/index.m3u8",

"欢乐剧场":"http://39.134.65.179/PLTV/88888888/224/3221225525/1.",

"热播精选":"http://39.135.138.60:18890/PLTV/88888910/224/3221225711/index.m3u8",

"东北热剧":"http://39.134.65.179/PLTV/88888888/224/3221225679/1.",

"东北热剧":"http://39.134.65.175/PLTV/88888888/224/3221225679/1.",

"家庭剧场":"http://39.134.65.166/PLTV/88888888/224/3221225538/1."};
